Alphabets= { 
	"español": { 
		'a': [1, 
			    ["a", 0], 
			    ["á", 1], 
			    ["à", 1], 
			    ["ă", 2], 
			    ["ắ", 3], 
			    ["ằ", 3], 
			    ["ẵ", 6], 
			    ["ẳ", 5], 
			    ["â", 2], 
			    ["ấ", 3], 
			    ["ầ", 3], 
			    ["ẫ", 6], 
			    ["ẩ", 5], 
			    ["ǎ", 2], 
			    ["å", 4], 
			    ["ǻ", 5], 
			    ["ä", 2], 
			    ["ǟ", 3], 
			    ["ã", 4], 
			    ["ȧ", 1], 
			    ["ǡ", 2], 
			    ["ą", 2], 
			    ["́ą́", 4], 
			    ["̃ą̃", 6], 
			    ["ā", 1], 
			    ["̀ā̀", 3], 
			    ["ả", 3], 
			    ["̋ȁ", 4], 
			    ["̋a̋", 2], 
			    ["ȃ", 2], 
			    ["ạ", 1], 
			    ["ặ", 3], 
			    ["ậ", 3], 
			    ["ḁ", 4], 
			    ["ⱥ", 1], 
			    ["ᶏ", 2], 
			    ["ẚ", 2] 
			], 
		'b': [1, 
				["b", 0], 
    			["ḃ", 1], 
    			["ḅ", 1], 
    			["ḇ", 1], 
    			["ƀ", 1], 
    			["ɓ", 2], 
    			["ꞗ", 3], 
    			["ᵬ", 4], 
    			["ᶀ", 2] 
			] 
		, 
		'c': [1, 
				["c", 0], 
    			["ć", 1], 
    			["ĉ", 2], 
    			["č", 2], 
    			["ċ", 1], 
    			["ç", 1], 
    			["ḉ", 2], 
    			["ȼ", 1], 
    			["ꞓ", 1], 
    			["ꞔ", 2], 
    			["ƈ", 2], 
    			["ɕ", 2] 
			] 
		, 
		'd': [1, 
				["d", 0], 
    			["ď", 1], 
    			["ḋ", 1], 
    			["ḑ", 1], 
    			["̦d̦", 1], 
    			["ḍ", 1], 
    			["ḓ", 2], 
    			["ḏ", 1], 
    			["đ", 1], 
    			["ð", 1], 
    			["ɖ", 2], 
    			["ɗ", 1], 
    			["ᵭ", 4], 
    			["ᶁ", 2], 
    			["ᶑ", 3], 
    			["ȡ", 4] 
			] 
		, 
		'e': [1, 
				["e", 0], 
    			["é", 1], 
    			["è", 1], 
    			["ĕ", 2], 
    			["ê", 2], 
    			["ế", 3], 
    			["ề", 3], 
    			["ễ", 6], 
    			["ể", 5], 
    			["̄ê̄", 4], 
    			["̌ê̌", 6], 
    			["ě", 2], 
    			["ë", 2], 
    			["ẽ", 4], 
    			["ė", 1], 
    			["́ė́", 3], 
    			["̃ė̃", 9], 
    			["ȩ", 1], 
    			["ḝ", 3], 
    			["ę", 2], 
    			["́ę́", 4], 
    			["̃ę̃", 6], 
    			["ē", 1], 
    			["ḗ", 2], 
    			["ḕ", 2], 
    			["ẻ", 3], 
    			["ȅ", 2], 
    			["e̋", 2], 
    			["ȇ", 2], 
    			["ẹ", 1], 
    			["ệ", 3], 
    			["ḙ", 2], 
    			["ḛ", 4], 
    			["ɇ", 1], 
    			["̩e̩", 1], 
    			["̩è̩", 2], 
    			["̩é̩", 2], 
    			["ᶒ", 2], 
    			["ⱸ", 2], 
    			["ꬴ", 2], 
			    ["ꬳ", 1] 
			] 
		, 
		'f': [2, 
				["f", 0], 
    			["ḟ", 1], 
    			["ƒ", 1], 
    			["ꞙ", 2], 
    			["ᵮ", 5], 
    			["ᶂ", 2] 
			] 
		, 
		'g': [1, 
				["g", 0], 
    			["ǵ", 1], 
    			["ğ", 2], 
    			["ĝ", 2], 
    			["ǧ", 2], 
    			["ġ", 1], 
    			["̃g̃", 4], 
    			["ģ", 1], 
    			["ḡ", 1], 
    			["ǥ", 1], 
    			["ꞡ", 1], 
    			["ɠ", 1], 
    			["ᶃ", 3], 
    			["ꬶ", 2] 
			] 
		, 
		'h': [2, 
				["h", 0], 
    			["ĥ", 2], 
    			["ȟ", 2], 
    			["ḧ", 2], 
    			["ḣ", 2], 
    			["ḩ", 1], 
    			["ḥ", 1], 
    			["ḫ", 2], 
    			["̱ẖ", 1], 
    			["ħ", 1], 
    			["ⱨ", 1], 
    			["ɦ", 1], 
    			["ꞕ", 1] 
			] 
		, 
		'i': [1, 
				["i", 0], 
			    ["í", 1], 
			    ["i̇́", 2], 
			    ["ì", 1], 
			    ["i̇̀", 2], 
			    ["ĭ", 2], 
			    ["î", 2], 
			    ["ǐ", 2], 
			    ["ï", 2], 
			    ["ḯ", 3], 
			    ["ĩ", 4], 
			    ["i̇̃", 5], 
			    ["į", 2], 
			    ["į́", 3], 
			    ["į̇́", 4], 
			    ["į̃", 6], 
			    ["į̇̃", 7], 
			    ["ī", 1], 
			    ["ī̀", 2], 
			    ["ỉ", 3], 
			    ["ȉ", 2], 
			    ["i̋", 2], 
			    ["ȋ", 2], 
			    ["ị", 2], 
			    ["ḭ", 5], 
			    ["ɨ", 2], 
			    ["ᶖ", 3], 
			    ["i̇", 1], 
			    ["ı", 0] 
			] 
		, 
		'j': [2, 
				["j", 0], 
    			["ĵ", 2], 
    			["ɉ", 1], 
    			["ǰ", 2], 
    			["ʝ", 2], 
    			["j̃", 4], 
    			["j̇̃", 5], 
    			["ɟ", 1], 
    			["ʄ", 2] 
			] 
		, 
		'k': [1, 
				["k", 0], 
    			["ḱ", 1], 
    			["ǩ", 2], 
    			["ķ", 1], 
    			["ḳ", 1], 
    			["ḵ", 1], 
    			["ƙ", 2], 
    			["ⱪ", 1], 
    			["ᶄ", 2], 
    			["ꝁ", 1], 
    			["ꝃ", 1], 
    			["ꝅ", 2], 
    			["ꞣ", 1] 
			] 
		, 
		'l': [2, 
				["l", 0], 
    			["ĺ", 1], 
    			["ľ", 1], 
    			["ļ", 1], 
    			["ḷ", 1], 
    			["ḹ", 2], 
    			["̃l̃", 8], 
    			["ḽ", 2], 
    			["ḻ", 1], 
    			["ł", 1], 
    			["ŀ", 1], 
    			["ƚ", 1], 
    			["ꝉ", 1], 
    			["ⱡ", 2], 
    			["ɫ", 4], 
    			["ɬ", 4], 
    			["ꞎ", 4], 
    			["ꬷ", 6], 
    			["ꬸ", 8], 
    			["ꬹ", 4], 
    			["ᶅ", 2], 
    			["ɭ", 2], 
    			["ȴ", 5] 
			] 
		, 
		'm': [2, 
				["m", 0], 
    			["ḿ", 1], 
    			["̋m̋", 2], 
    			["ṁ", 1], 
    			["ṃ", 1], 
    			["̃m̃", 4], 
    			["ᵯ", 4], 
    			["ᶆ", 2], 
    			["ɱ", 2], 
    			["ꬺ", 4] 
			] 
		, 
		'n': [2, 
				["n", 0], 
    			["ń", 1], 
    			["ǹ", 1], 
    			["ň", 2], 
    			["ṅ", 1], 
    			["ņ", 1], 
    			["ṇ", 1], 
    			["ṋ", 2], 
    			["ṉ", 1], 
    			["̈n̈", 2], 
    			["ɲ", 1], 
    			["ŋ", 1], 
    			["ƞ", 1], 
    			["ꞑ", 1], 
    			["ꞥ", 1], 
    			["ᵰ", 4], 
    			["ᶇ", 2], 
    			["ɳ", 1], 
    			["ȵ", 4], 
    			["ꬻ", 4], 
    			["ꬼ", 2] 
			] 
		, 
		'ñ': [2, 
				['ñ', 0] 
			] 
		, 
		'o': [1, 
				["o", 0], 
			    ["ó", 1], 
			    ["ò", 1], 
			    ["ŏ", 2], 
			    ["ô", 2], 
			    ["ố", 3], 
			    ["ồ", 3], 
			    ["ỗ", 6], 
			    ["ổ", 5], 
			    ["ǒ", 2], 
			    ["ö", 2], 
			    ["ȫ", 3], 
			    ["ő", 2], 
			    ["õ", 4], 
			    ["ṍ", 5], 
			    ["ṏ", 6], 
			    ["ȭ", 5], 
			    ["ȯ", 1], 
			    ["͘o͘", 2], 
			    ["ȱ", 2], 
			    ["ø", 1], 
			    ["ǿ", 2], 
			    ["ǫ", 2], 
			    ["ǭ", 3], 
			    ["ō", 1], 
			    ["ṓ", 2], 
			    ["ṑ", 2], 
			    ["ỏ", 3], 
			    ["ȍ", 2], 
			    ["ȏ", 2], 
			    ["ơ", 1], 
			    ["ớ", 2], 
			    ["ờ", 2], 
			    ["ỡ", 5], 
			    ["ở", 4], 
			    ["ợ", 2], 
			    ["ọ", 1], 
			    ["ộ", 3], 
			    ["̩o̩", 1], 
			    ["̩ò̩", 2], 
			    ["̩ó̩", 2], 
			    ["ɵ", 1], 
			    ["ꝋ", 1], 
			    ["ꝍ", 3], 
			    ["ⱺ", 4] 
			] 
		, 
		'p': [1, 
				["p", 0], 
    			["ṕ", 1], 
    			["ṗ", 1], 
    			["ᵽ", 1], 
    			["ꝑ", 1], 
    			["ƥ", 1], 
    			["ꝓ", 1], 
    			["ꝕ", 3], 
    			["̃p̃", 4], 
    			["ᵱ", 4], 
    			["ᶈ", 2] 
			] 
		, 
		'q': [1, 
				["q", 0], 
			    ["ꝗ", 1], 
			    ["ꝙ", 2], 
			    ["ɋ", 1], 
			    ["ʠ", 1] 
			] 
		, 
		'r': [2, 
				["r", 0], 
    			["ŕ", 1], 
    			["ř", 2], 
    			["ṙ", 1], 
    			["ŗ", 1], 
    			["ȑ", 2], 
    			["ȓ", 2], 
    			["ṛ", 1], 
    			["ṝ", 2], 
    			["ṟ", 1], 
    			["̃r̃", 4], 
    			["ɍ", 1], 
    			["ꞧ", 1], 
    			["ɽ", 2], 
    			["ᵲ", 5], 
    			["ᶉ", 2], 
    			["ꭉ", 4] 
			] 
		, 
		's': [2, 
				["s", 0], 
    			["ś", 1], 
    			["ṥ", 2], 
    			["ŝ", 2], 
    			["š", 2], 
    			["ṧ", 3], 
    			["̈s̈", 2], 
    			["ṡ", 1], 
    			["ş", 1], 
    			["ṣ", 1], 
    			["ṩ", 2], 
    			["ș", 1], 
    			["̩s̩", 1], 
    			["ꞩ", 1], 
    			["ȿ", 2], 
    			["ʂ", 2], 
    			["ᶊ", 2], 
    			["ᵴ", 4] 
			] 
		, 
		't': [1, 
				["t", 0], 
    			["ť", 1], 
    			["ṫ", 1], 
    			["ţ", 1], 
    			["ṭ", 1], 
    			["ț", 1], 
    			["ṱ", 2], 
    			["ṯ", 1], 
    			["ŧ", 1], 
    			["ⱦ", 1], 
    			["ƭ", 3], 
    			["ʈ", 0], 
    			["̈ẗ", 4], 
    			["ᵵ", 4], 
    			["ƫ", 2], 
    			["ȶ", 4] 
			] 
		, 
		'u': [1, 
				["u", 0], 
				["ú", 1], 
				["ù", 1], 
				["ŭ", 2], 
				["û", 2], 
				["ǔ", 2], 
				["ů", 4], 
				["ü", 2], 
				["ǘ", 3], 
				["ǜ", 3], 
				["ǚ", 4], 
				["ǖ", 3], 
				["ű", 2], 
				["ũ", 4], 
				["ṹ", 5], 
				["ų", 2], 
				["́ų́", 4], 
				["̃ų̃", 6], 
				["ū", 1], 
				["ṻ", 3], 
				["̀ū̀", 3], 
				["́ū́", 3], 
				["̃ū̃", 9], 
				["ủ", 3], 
				["ȕ", 2], 
				["ȗ", 2], 
				["ư", 1], 
				["ứ", 2], 
				["ừ", 2], 
				["ữ", 5], 
				["ử", 4], 
				["ự", 2], 
				["ụ", 1], 
				["ṳ", 2], 
				["ṷ", 2], 
				["ṵ", 4], 
				["ʉ", 1], 
				["ᶙ", 2], 
				["ꭒ", 1] 
			] 
		, 
		'v': [2, 
				["v", 0], 
    			["ṽ", 4], 
    			["ṿ", 1], 
    			["ꝟ", 1], 
    			["ʋ", 1], 
    			["ỽ", 0], 
    			["ᶌ", 2], 
    			["ⱱ", 1], 
    			["ⱴ", 3] 
			] 
		, 
		'w': [3, 
				["w", 0], 
    			["ẃ", 1], 
    			["ẁ", 1], 
    			["ŵ", 2], 
    			["ẅ", 2], 
    			["ẇ", 1], 
    			["ẉ", 1], 
    			["̊ẘ", 4], 
    			["ⱳ", 1] 
			] 
		, 
		'x': [2, 
				["x", 0], 
    			["́x́", 1], 
    			["̂x̂", 2], 
    			["ẍ", 2], 
    			["̌x̌", 2], 
    			["ẋ", 1], 
    			["̧x̧", 1], //
    			["̱x̱", 1], 
    			["̣x̣", 1], 
    			["ᶍ", 2] 
			] 
		, 
		'y': [3, 
				["y", 0], 
    			["ý", 1], 
    			["ỳ", 1], 
    			["ŷ", 2], 
    			["̊ẙ", 4], 
    			["ÿ", 2], 
    			["ỹ", 4], 
    			["ẏ", 1], 
    			["ȳ", 1], 
    			["ỷ", 3], 
    			["ỵ", 1], 
    			["ɏ", 1], 
    			["ƴ", 1], 
    			["ỿ", 4] 
			] 
		, 
		'z': [2, 
				["z", 0], 
    			["ź", 1], 
    			["ẑ", 2], 
    			["ž", 2], 
    			["ż", 1], 
    			["ẓ", 1], 
    			["ẕ", 1], 
    			["ƶ", 1], 
    			["ȥ", 2], 
    			["ⱬ", 1], 
    			["ɀ", 2], 
    			["ᶎ", 2], 
    			["ᵶ", 4], 
    			["ʐ", 2], 
    			["ʑ", 3] 
			] 
		/* 
		"español": [ 
			['a', [2, 
				['á', 1]  
			]], 
		] 
		*/ 
	},/*, "english": [ 

	] */  "english": { 
		'a': [2, 
			    ["a", 0], 
			    ["á", 1], 
			    ["à", 1], 
			    ["ă", 2], 
			    ["ắ", 3], 
			    ["ằ", 3], 
			    ["ẵ", 6], 
			    ["ẳ", 5], 
			    ["â", 2], 
			    ["ấ", 3], 
			    ["ầ", 3], 
			    ["ẫ", 6], 
			    ["ẩ", 5], 
			    ["ǎ", 2], 
			    ["å", 4], 
			    ["ǻ", 5], 
			    ["ä", 2], 
			    ["ǟ", 3], 
			    ["ã", 4], 
			    ["ȧ", 1], 
			    ["ǡ", 2], 
			    ["ą", 2], 
			    ["́ą́", 4], 
			    ["̃ą̃", 6], 
			    ["ā", 1], 
			    ["̀ā̀", 3], 
			    ["ả", 3], 
			    ["̋ȁ", 4], 
			    ["̋a̋", 2], 
			    ["ȃ", 2], 
			    ["ạ", 1], 
			    ["ặ", 3], 
			    ["ậ", 3], 
			    ["ḁ", 4], 
			    ["ⱥ", 1], 
			    ["ᶏ", 2], 
			    ["ẚ", 2] 
			], 
		'b': [1, 
				["b", 0], 
    			["ḃ", 1], 
    			["ḅ", 1], 
    			["ḇ", 1], 
    			["ƀ", 1], 
    			["ɓ", 2], 
    			["ꞗ", 3], 
    			["ᵬ", 4], 
    			["ᶀ", 2] 
			] 
		, 
		'c': [1, 
				["c", 0], 
    			["ć", 1], 
    			["ĉ", 2], 
    			["č", 2], 
    			["ċ", 1], 
    			["ç", 1], 
    			["ḉ", 2], 
    			["ȼ", 1], 
    			["ꞓ", 1], 
    			["ꞔ", 2], 
    			["ƈ", 2], 
    			["ɕ", 2] 
			] 
		, 
		'd': [1, 
				["d", 0], 
    			["ď", 1], 
    			["ḋ", 1], 
    			["ḑ", 1], 
    			["̦d̦", 1], 
    			["ḍ", 1], 
    			["ḓ", 2], 
    			["ḏ", 1], 
    			["đ", 1], 
    			["ð", 1], 
    			["ɖ", 2], 
    			["ɗ", 1], 
    			["ᵭ", 4], 
    			["ᶁ", 2], 
    			["ᶑ", 3], 
    			["ȡ", 4] 
			] 
		, 
		'e': [1, 
				["e", 0], 
    			["é", 1], 
    			["è", 1], 
    			["ĕ", 2], 
    			["ê", 2], 
    			["ế", 3], 
    			["ề", 3], 
    			["ễ", 6], 
    			["ể", 5], 
    			["̄ê̄", 4], 
    			["̌ê̌", 6], 
    			["ě", 2], 
    			["ë", 2], 
    			["ẽ", 4], 
    			["ė", 1], 
    			["́ė́", 3], 
    			["̃ė̃", 9], 
    			["ȩ", 1], 
    			["ḝ", 3], 
    			["ę", 2], 
    			["́ę́", 4], 
    			["̃ę̃", 6], 
    			["ē", 1], 
    			["ḗ", 2], 
    			["ḕ", 2], 
    			["ẻ", 3], 
    			["ȅ", 2], 
    			["e̋", 2], 
    			["ȇ", 2], 
    			["ẹ", 1], 
    			["ệ", 3], 
    			["ḙ", 2], 
    			["ḛ", 4], 
    			["ɇ", 1], 
    			["̩e̩", 1], 
    			["̩è̩", 2], 
    			["̩é̩", 2], 
    			["ᶒ", 2], 
    			["ⱸ", 2], 
    			["ꬴ", 2], 
			    ["ꬳ", 1] 
			] 
		, 
		'f': [1, 
				["f", 0], 
    			["ḟ", 1], 
    			["ƒ", 1], 
    			["ꞙ", 2], 
    			["ᵮ", 5], 
    			["ᶂ", 2] 
			] 
		, 
		'g': [1, 
				["g", 0], 
    			["ǵ", 1], 
    			["ğ", 2], 
    			["ĝ", 2], 
    			["ǧ", 2], 
    			["ġ", 1], 
    			["̃g̃", 4], 
    			["ģ", 1], 
    			["ḡ", 1], 
    			["ǥ", 1], 
    			["ꞡ", 1], 
    			["ɠ", 1], 
    			["ᶃ", 3], 
    			["ꬶ", 2] 
			] 
		, 
		'h': [2, 
				["h", 0], 
    			["ĥ", 2], 
    			["ȟ", 2], 
    			["ḧ", 2], 
    			["ḣ", 2], 
    			["ḩ", 1], 
    			["ḥ", 1], 
    			["ḫ", 2], 
    			["̱ẖ", 1], 
    			["ħ", 1], 
    			["ⱨ", 1], 
    			["ɦ", 1], 
    			["ꞕ", 1] 
			] 
		, 
		'i': [2, 
				["i", 0], 
			    ["í", 1], 
			    ["i̇́", 2], 
			    ["ì", 1], 
			    ["i̇̀", 2], 
			    ["ĭ", 2], 
			    ["î", 2], 
			    ["ǐ", 2], 
			    ["ï", 2], 
			    ["ḯ", 3], 
			    ["ĩ", 4], 
			    ["i̇̃", 5], 
			    ["į", 2], 
			    ["į́", 3], 
			    ["į̇́", 4], 
			    ["į̃", 6], 
			    ["į̇̃", 7], 
			    ["ī", 1], 
			    ["ī̀", 2], 
			    ["ỉ", 3], 
			    ["ȉ", 2], 
			    ["i̋", 2], 
			    ["ȋ", 2], 
			    ["ị", 2], 
			    ["ḭ", 5], 
			    ["ɨ", 2], 
			    ["ᶖ", 3], 
			    ["i̇", 1], 
			    ["ı", 0] 
			] 
		, 
		'j': [2, 
				["j", 0], 
    			["ĵ", 2], 
    			["ɉ", 1], 
    			["ǰ", 2], 
    			["ʝ", 2], 
    			["j̃", 4], 
    			["j̇̃", 5], 
    			["ɟ", 1], 
    			["ʄ", 2] 
			] 
		, 
		'k': [2, 
				["k", 0], 
    			["ḱ", 1], 
    			["ǩ", 2], 
    			["ķ", 1], 
    			["ḳ", 1], 
    			["ḵ", 1], 
    			["ƙ", 2], 
    			["ⱪ", 1], 
    			["ᶄ", 2], 
    			["ꝁ", 1], 
    			["ꝃ", 1], 
    			["ꝅ", 2], 
    			["ꞣ", 1] 
			] 
		, 
		'l': [1, 
				["l", 0], 
    			["ĺ", 1], 
    			["ľ", 1], 
    			["ļ", 1], 
    			["ḷ", 1], 
    			["ḹ", 2], 
    			["̃l̃", 8], 
    			["ḽ", 2], 
    			["ḻ", 1], 
    			["ł", 1], 
    			["ŀ", 1], 
    			["ƚ", 1], 
    			["ꝉ", 1], 
    			["ⱡ", 2], 
    			["ɫ", 4], 
    			["ɬ", 4], 
    			["ꞎ", 4], 
    			["ꬷ", 6], 
    			["ꬸ", 8], 
    			["ꬹ", 4], 
    			["ᶅ", 2], 
    			["ɭ", 2], 
    			["ȴ", 5] 
			] 
		, 
		'm': [1, 
				["m", 0], 
    			["ḿ", 1], 
    			["̋m̋", 2], 
    			["ṁ", 1], 
    			["ṃ", 1], 
    			["̃m̃", 4], 
    			["ᵯ", 4], 
    			["ᶆ", 2], 
    			["ɱ", 2], 
    			["ꬺ", 4] 
			] 
		, 
		'n': [1, 
				["n", 0], 
    			["ń", 1], 
    			["ǹ", 1], 
    			["ň", 2], 
    			["ñ", 4], 
    			["ṅ", 1], 
    			["ņ", 1], 
    			["ṇ", 1], 
    			["ṋ", 2], 
    			["ṉ", 1], 
    			["̈n̈", 2], 
    			["ɲ", 1], 
    			["ŋ", 1], 
    			["ƞ", 1], 
    			["ꞑ", 1], 
    			["ꞥ", 1], 
    			["ᵰ", 4], 
    			["ᶇ", 2], 
    			["ɳ", 1], 
    			["ȵ", 4], 
    			["ꬻ", 4], 
    			["ꬼ", 2] 
			] 
		, 
		'o': [2, 
				["o", 0], 
			    ["ó", 1], 
			    ["ò", 1], 
			    ["ŏ", 2], 
			    ["ô", 2], 
			    ["ố", 3], 
			    ["ồ", 3], 
			    ["ỗ", 6], 
			    ["ổ", 5], 
			    ["ǒ", 2], 
			    ["ö", 2], 
			    ["ȫ", 3], 
			    ["ő", 2], 
			    ["õ", 4], 
			    ["ṍ", 5], 
			    ["ṏ", 6], 
			    ["ȭ", 5], 
			    ["ȯ", 1], 
			    ["͘o͘", 2], 
			    ["ȱ", 2], 
			    ["ø", 1], 
			    ["ǿ", 2], 
			    ["ǫ", 2], 
			    ["ǭ", 3], 
			    ["ō", 1], 
			    ["ṓ", 2], 
			    ["ṑ", 2], 
			    ["ỏ", 3], 
			    ["ȍ", 2], 
			    ["ȏ", 2], 
			    ["ơ", 1], 
			    ["ớ", 2], 
			    ["ờ", 2], 
			    ["ỡ", 5], 
			    ["ở", 4], 
			    ["ợ", 2], 
			    ["ọ", 1], 
			    ["ộ", 3], 
			    ["̩o̩", 1], 
			    ["̩ò̩", 2], 
			    ["̩ó̩", 2], 
			    ["ɵ", 1], 
			    ["ꝋ", 1], 
			    ["ꝍ", 3], 
			    ["ⱺ", 4] 
			] 
		, 
		'p': [1, 
				["p", 0], 
    			["ṕ", 1], 
    			["ṗ", 1], 
    			["ᵽ", 1], 
    			["ꝑ", 1], 
    			["ƥ", 1], 
    			["ꝓ", 1], 
    			["ꝕ", 3], 
    			["̃p̃", 4], 
    			["ᵱ", 4], 
    			["ᶈ", 2] 
			] 
		, 
		'q': [3, 
				["q", 0], 
			    ["ꝗ", 1], 
			    ["ꝙ", 2], 
			    ["ɋ", 1], 
			    ["ʠ", 1] 
			] 
		, 
		'r': [1, 
				["r", 0], 
    			["ŕ", 1], 
    			["ř", 2], 
    			["ṙ", 1], 
    			["ŗ", 1], 
    			["ȑ", 2], 
    			["ȓ", 2], 
    			["ṛ", 1], 
    			["ṝ", 2], 
    			["ṟ", 1], 
    			["̃r̃", 4], 
    			["ɍ", 1], 
    			["ꞧ", 1], 
    			["ɽ", 2], 
    			["ᵲ", 5], 
    			["ᶉ", 2], 
    			["ꭉ", 4] 
			] 
		, 
		's': [1, 
				["s", 0], 
    			["ś", 1], 
    			["ṥ", 2], 
    			["ŝ", 2], 
    			["š", 2], 
    			["ṧ", 3], 
    			["̈s̈", 2], 
    			["ṡ", 1], 
    			["ş", 1], 
    			["ṣ", 1], 
    			["ṩ", 2], 
    			["ș", 1], 
    			["̩s̩", 1], 
    			["ꞩ", 1], 
    			["ȿ", 2], 
    			["ʂ", 2], 
    			["ᶊ", 2], 
    			["ᵴ", 4] 
			] 
		, 
		't': [1, 
				["t", 0], 
    			["ť", 1], 
    			["ṫ", 1], 
    			["ţ", 1], 
    			["ṭ", 1], 
    			["ț", 1], 
    			["ṱ", 2], 
    			["ṯ", 1], 
    			["ŧ", 1], 
    			["ⱦ", 1], 
    			["ƭ", 3], 
    			["ʈ", 0], 
    			["̈ẗ", 4], 
    			["ᵵ", 4], 
    			["ƫ", 2], 
    			["ȶ", 4] 
			] 
		, 
		'u': [2, 
				["u", 0], 
				["ú", 1], 
				["ù", 1], 
				["ŭ", 2], 
				["û", 2], 
				["ǔ", 2], 
				["ů", 4], 
				["ü", 2], 
				["ǘ", 3], 
				["ǜ", 3], 
				["ǚ", 4], 
				["ǖ", 3], 
				["ű", 2], 
				["ũ", 4], 
				["ṹ", 5], 
				["ų", 2], 
				["́ų́", 4], 
				["̃ų̃", 6], 
				["ū", 1], 
				["ṻ", 3], 
				["̀ū̀", 3], 
				["́ū́", 3], 
				["̃ū̃", 9], 
				["ủ", 3], 
				["ȕ", 2], 
				["ȗ", 2], 
				["ư", 1], 
				["ứ", 2], 
				["ừ", 2], 
				["ữ", 5], 
				["ử", 4], 
				["ự", 2], 
				["ụ", 1], 
				["ṳ", 2], 
				["ṷ", 2], 
				["ṵ", 4], 
				["ʉ", 1], 
				["ᶙ", 2], 
				["ꭒ", 1] 
			] 
		, 
		'v': [1, 
				["v", 0], 
    			["ṽ", 4], 
    			["ṿ", 1], 
    			["ꝟ", 1], 
    			["ʋ", 1], 
    			["ỽ", 0], 
    			["ᶌ", 2], 
    			["ⱱ", 1], 
    			["ⱴ", 3] 
			] 
		, 
		'w': [3, 
				["w", 0], 
    			["ẃ", 1], 
    			["ẁ", 1], 
    			["ŵ", 2], 
    			["ẅ", 2], 
    			["ẇ", 1], 
    			["ẉ", 1], 
    			["̊ẘ", 4], 
    			["ⱳ", 1] 
			] 
		, 
		'x': [1, 
				["x", 0], 
    			["́x́", 1], 
    			["̂x̂", 2], 
    			["ẍ", 2], 
    			["̌x̌", 2], 
    			["ẋ", 1], 
    			["̧x̧", 1], //
    			["̱x̱", 1], 
    			["̣x̣", 1], 
    			["ᶍ", 2] 
			] 
		, 
		'y': [3, 
				["y", 0], 
    			["ý", 1], 
    			["ỳ", 1], 
    			["ŷ", 2], 
    			["̊ẙ", 4], 
    			["ÿ", 2], 
    			["ỹ", 4], 
    			["ẏ", 1], 
    			["ȳ", 1], 
    			["ỷ", 3], 
    			["ỵ", 1], 
    			["ɏ", 1], 
    			["ƴ", 1], 
    			["ỿ", 4] 
			] 
		, 
		'z': [1, 
				["z", 0], 
    			["ź", 1], 
    			["ẑ", 2], 
    			["ž", 2], 
    			["ż", 1], 
    			["ẓ", 1], 
    			["ẕ", 1], 
    			["ƶ", 1], 
    			["ȥ", 2], 
    			["ⱬ", 1], 
    			["ɀ", 2], 
    			["ᶎ", 2], 
    			["ᵶ", 4], 
    			["ʐ", 2], 
    			["ʑ", 3] 
			] 
		/* 
		"español": [ 
			['a', [2, 
				['á', 1]  
			]], 
		] 
		*/ 
	}
}; 
   
getDedications= function(language){ 
	s= 0; 
	Name= []; 
	Name[s]= 0; 
	n= ""; 
	name= document.getElementsByTagName("input")[0].value; 
	syl= ""; 
	Syl= []; 
	i= 0; 
	text= document.getElementsByTagName("textarea")[0].value.toLowerCase(); 
                    
	for(e in text){ 
		if(text[e] != "-" && text[e] != " " && parseInt(e) != text.length - 1){ 
			syl+= text[e]; 
		}else{ 
			parseInt(e) == text.length - 1? syl+= text[e]: 3231; 

			Syl[i]= syl; 
			i++; 
			     
			text[e] == " "? syl= "": 1; 
		} 
	} 
      
	names= function(){ 
		for(u in name){ 
			if(name[u] != " "){ 
				for(r in Alphabets[language]){ 
					for(eForensics in Alphabets[language][r]){ 
						parseInt(eForensics) != 0? name[u].toLowerCase() == Alphabets[language][r][eForensics][0]? (name[parseInt(u) - 1] == "'" || name[parseInt(u) + 1] == "'")? Name[s]+= Alphabets[language][r][0] + Alphabets[language][r][0] + Alphabets[language][r][0] * Alphabets[language][r][eForensics][1]: Name[s]+= Alphabets[language][r][0] + Alphabets[language][r][0] * Alphabets[language][r][eForensics][1]:17288: 1981; 
					} 
				} 
			}else{ 
				s++; 
				Name[s]= 0; 
			} 
		} 
	} 
      
	dedications= function(){ 
		names(); 
		dedication= ""; 
		naM= 0; 
                
		for(q in Syl){ 
			sT= parseInt(q); 
			nuMber= 0; 
                       
			dedication+= Syl[sT] + " "; 
                               
			for(er_R in Name){ 
				nuMber+= Name[er_R]; 
				final_nuMber= nuMber + sT; 
                                           
				while(final_nuMber >= Syl.length){ 
					final_nuMber-= Syl.length; 
				} 
                  
				dedication+= Syl[final_nuMber] + " "; 
			} 
              
			document.getElementsByTagName("textarea")[1].value= document.getElementsByTagName("textarea")[1].value + dedication + "\n"; 
                            
			dedication= ""; 
		} 
          
        document.getElementsByTagName("textarea")[1].value= document.getElementsByTagName("textarea")[1].value + "//////////////////////////////////////////////////////////" + "\n\n"; 
	} 
      
	dedications(); 
} 
  
  
//onClipEvent(load){ 
function update(){ 
    document.getElementsByTagName("body")[0].style.cursor != "nw-resize"? document.getElementsByTagName("body")[0].style.cursor= "nw-resize": document.getElementsByTagName("body")[0].style.cursor= "ne-resize"; 
} 
  
rwrrw= ""; 
mousedown= false; 
dsrcrs= [ 
  "#339dc1", 
  "#ce0c27", 
  "#339dc1", 
  "#339dc1", 
  "#339dc1", 
  "#339dc1", 
  "#339dc1", 
  "#339dc1", 
  "#f3d21d", 
  "#2919dd", 
  "#71ff21", 
  "#339dc1" 
]; 

opacity= function(color, op){ 
    switch(color){
        case azul:
            $("#styA")[0].innerHTML= ".\\#2919dd{opacity:" + op + "}"; 
            break;
        case verde:
            $("#styV")[0].innerHTML= ".\\#71ff21{opacity:" + op + "}"; 
            break;
        case rojo:
            $("#styR")[0].innerHTML= ".\\#ce0c27{opacity:" + op + "}"; 
            break;
        case amarillo:
            $("#styAm")[0].innerHTML= ".\\#f3d21d{opacity:" + op + "}"; 
            break;
    }
} 

azul= "rgb(41, 25, 221)"; 
verde= "rgb(113, 255, 33)"; 
rojo= "rgb(255, 18, 19)"; 
amarillo= "rgb(243,210,29)"; 

var interval; 

function setinterval(f)
{
	clearInterval(interval); 

	interval= setInterval(function(){f();}, 235); 
}
function2= function(){ 
    cr != azul? opacity(azul, 0): 1; 
    cr != verde? opacity(verde, 0): 1; 
    cr != rojo? opacity(rojo, 0): 1; 
    cr != amarillo? opacity(amarillo, 0): 1; 

    if(goingUp && ioi < 1){ 
        ioi+= 0.01; 
        opacity(cr, ioi); 
    } 
      
    if(goingDown && ioi > 0){ 
        ioi-= 0.01; 
        opacity(cr, ioi); 
    } 

    if(goingUp && ioi >= 1){ 
        goingUp= false; 
        setTimeout(function(){ 
            goingDown= true; 
        }, 2345) 
    } 
      
    if(goingDown && ioi <= 0){ 
        goingDown= false; 
        setTimeout(function(){ 
            cr == azul? cr= verde: cr == verde? cr= rojo: cr == rojo? cr= amarillo: cr == amarillo? cr= azul: 1; 
            goingUp= true; 
        }, 2345) 
    }
}
        
function3= function(){ 
    switch(ioi){ 
        case 0: 
            opacity(azul, 0); 
            opacity(verde, 0); 
            opacity(rojo, 1); 
            opacity(amarillo, 1); 
        break; 
        case 1: 
            opacity(azul, 1); 
            opacity(verde, 1); 
            opacity(rojo, 0); 
            opacity(amarillo, 0); 
        break; 
    } 
    ioi < 1? ioi++: ioi= 0; 
}
        
function4= function(){ 
    switch(ioi){ 
        case 0: 
            opacity(azul, 0); 
            opacity(rojo, 0); 
            opacity(verde, 1); 
            opacity(amarillo, 1); 
        break; 
        case 1: 
            opacity(azul, 1); 
            opacity(rojo, 1); 
            opacity(verde, 0); 
            opacity(amarillo, 0); 
        break; 
    } 
    ioi < 1? ioi++: ioi= 0; 
}
        
function5= function(){ 
    switch(ioi){ 
        case 0: 
            opacity(azul, 0); 
            opacity(amarillo, 0); 
            opacity(rojo, 1); 
            opacity(verde, 1); 
        break; 
        case 1: 
            opacity(azul, 1); 
            opacity(amarillo, 1); 
            opacity(rojo, 0); 
            opacity(verde, 0); 
        break; 
    } 
    ioi < 1? ioi++: ioi= 0; 
}


function6= function(){for(e= 0; e < document.getElementsByTagName("div").length - 1; e++){document.getElementsByTagName("div")[e].style.backgroundColor != "rgb(51, 157, 193)"? Math.random() * 2 > 1? document.getElementsByTagName("div")[e].style.opacity= 1: document.getElementsByTagName("div")[e].style.opacity= 0: 1; };}
//} 
    
//onClipEvent(enterframe){ 
setInterval(function(){ 
    update(); 
}, 0.00); 
          
document.addEventListener("keydown", function(i){                                                                                                               
    if(i.keyCode == 113){ 
        $("#r4Ndom div").css({"opacity": ""}); 
                            
        i.preventDefault(); 
                          
        opacity(azul, 0); 
                          
        opacity(verde, 0); 
                          
        opacity(rojo, 0); 
                          
        opacity(amarillo, 0); 
                       
        goingUp= true; 
        goingDown= false; 
        cr= azul; 
        ioi= 0; 
                
        setinterval(function2); 
    } 
      
    if(i.keyCode == 114){ 
        $("#r4Ndom div").css({"opacity": ""}); 
                            
        i.preventDefault(); 

        ioi= 0; 
                
        setinterval(function3); 
    } 
      
    if(i.keyCode == 115){ 
        $("#r4Ndom div").css({"opacity": ""}); 
                            
        i.preventDefault(); 


        ioi= 0; 
                
        setinterval(function4); 
    } 
      
    if(i.keyCode == 116){ 
        $("#r4Ndom div").css({"opacity": ""}); 
                            
        i.preventDefault(); 

        ioi= 0; 

        setinterval(function5); 
    } 
      
    if(i.keyCode == 117){ 
        i.preventDefault(); 

        ioi= 0; 

        setinterval(function6); 
    } 

    if(i.keyCode == 112){ 
        $("#r4Ndom div").css({"opacity": ""}); 
                            
        i.preventDefault(); 

        ioi= 1; 
                
        opacity(azul, ioi); 
                            
        opacity(verde, ioi); 
                            
        opacity(rojo, ioi); 
                            
        opacity(amarillo, ioi); 

		clearInterval(interval);                           
    } 
}); 
    
document.addEventListener("mousedown", function(i){ 
    mousedown= true; 
                     
    //i.target == lastChild? lastChild.innerHTML= lastChild.innerHTML + "<div style= 'width: 4.78px; height: 4.78px; background-color: " + "#339dc1" + "; position: absolute; left: " + i.layerX + "px; top: " + i.layerY +  "px; '></div>": 1; 
                     
    /*(i.keyCode == 17 && lastChild.outerHTML.indexOf("Rwawwr") == 9)? lastChild.outerHTML= "": 3251; */ 
}); 
    
document.addEventListener("mouseup", function(i){ 
    mousedown= false; 
                      
    /*me= w.keyCode; */ 
}); //The question, the quest off...  
    
document.addEventListener("mousemove", function(i){                                                 
    L= parseInt(Math.random() * dsrcrs.length); 
                                                
    MNSWMTG= parseInt(Math.random() * 2) == 0? "1": "1000000"; 
                                                               
    PpPE= dsrcrs[L] == "#339dc1"? "; z-index: 2": "; border-radius: 50%; z-index: " + MNSWMTG; 
                                                              
    dsrcrs[L] == "#339dc1"? MNSWMTG = false: 214;                                   

    (mousedown)? $("#r4Ndom").append("<div class= '" + dsrcrs[L] + "' style= 'width: 6.8px; height: 6.8px; background-color: " + dsrcrs[L] + PpPE + "; position: absolute; left: " + i.pageX + "px; top: " + i.pageY +  "px; '></div>" + (MNSWMTG > 1? "<div class= '#339dc1' style= 'width: 6.8px; height: 6.8px; background-color: #339dc1; z-index: 2; position: absolute; left: " + i.pageX + "px; top: " + i.pageY +  "px; '></div>": "")): 13781;
}); 
    
document.addEventListener("keyup", function(i){                                                

}); 
//} 